app/Controllers/Categorias.php

SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function getIndex($activo = 1 )
    {
        $categorias = $this->categorias->where('activo',$activo)->findAll();

UPDATE `categorias` SET `nombre` = 'vacia era creo', `fecha_edit` = '2023-06-17 08:15:35'
WHERE `categorias`.`id` IN ('4')
---
    public function postActualizar()

    {
      if($this->request->getMethod() == 'post' && $this->validate($this->reglas)){
      $this->categorias->update($this->request->getPost('id'),['nombre' => $this->request->getpost('nombre') ]);

SELECT *
FROM `categorias`
WHERE `activo` = 0
---
   public function getEliminados($activo = 0)
   {
       $categorias = $this->categorias->where('activo',$activo)->findAll();