app/Controllers/Clientes.php

    public function getIndex($activo = 1 )
    {
        $clientes = $this->clientes->where('activo',$activo)->findAll();
---
SELECT *
FROM `clientes`
WHERE `activo` = 1

   public function getRestaurar($id){

    $this->clientes->update($id,['activo' => 1]);
---
UPDATE `clientes` SET `activo` = 1, `fecha_edit` = '2023-06-15 19:21:37'
WHERE `clientes`.`id` IN ('1')

   public function getEliminados($activo = 0)
   {
       $clientes = $this->clientes->where('activo',$activo)->findAll();
---
SELECT *
FROM `clientes`
WHERE `activo` = 0