app/Controllers/Productos.php

    public function getIndex($activo = 1 )
    {
        $productos = $this->productos->where('activo',$activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

    public function getNuevo(){
        $categorias = $this->categorias->where('activo', 1)->findAll();
        $unidades = $this->unidades->where('activo', 1)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function getEditar($id, $valid = null){

      $categorias = $this->categorias->where('activo', 1)->findAll();
      $unidades = $this->unidades->where('activo', 1)->findAll();
        $producto = $this->productos->where('id', $id)->first();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `productos`
WHERE `id` = '3'
 LIMIT 1