app/Controllers/Productos.php

    public function getIndex($activo = 1 )
    {
        $productos = $this->productos->where('activo',$activo)->findAll();
---
SELECT *
FROM `productos`
WHERE `activo` = 1

    public function getNuevo(){
        $categorias = $this->categorias->where('activo', 1)->findAll();
        $unidades = $this->unidades->where('activo', 1)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function postInsertar()

    {
      if($this->request->getMethod() == 'post' && $this->validate(['nombre' => 'required'])){

        $this->productos->save(['codigo' => $this->request->getpost('codigo'),
                                'nombre' => $this->request->getpost('nombre'),
                                'id_unidad' => $this->request->getpost('id_unidad'),
                                'id_categoria' => $this->request->getpost('id_categoria'),
                                'precio_venta' => $this->request->getpost('precio_venta'),
                                'precio_compra' => $this->request->getpost('precio_compra'),
                                'stock_minimo' => $this->request->getpost('stock_minimo'),
                                'inventariable' => $this->request->getpost('inventariable'),

                              ]);
---
INSERT INTO `productos` (`codigo`, `nombre`, `id_unidad`, `id_categoria`, `precio_venta`, `precio_compra`, `stock_minimo`, `inventariable`, `fecha_alta`, `fecha_edit`) VALUES ('123', 'Lomo de Ternera', '1', '3', '10', '15', '10', '1', '2023-06-13 20:35:55', '2023-06-13 20:35:55')