app/Controllers/Unidades.php

    public function getIndex($activo = 1 )
    {
        $unidades = $this->unidades->where('activo',$activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function getEditar($id){

        $unidad = $this->unidades->where('id', $id)->first();
---
SELECT *
FROM `unidades`
WHERE `id` = '2'
 LIMIT 1

   public function getEliminados($activo = 0)
   {
       $unidades = $this->unidades->where('activo',$activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 0