app/Controllers/Unidades.php

    public function getIndex($activo = 1 )
    {
        $unidades = $this->unidades->where('activo',$activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1