app/Controllers/Usuarios.php

SELECT *
FROM `usuarios`
WHERE `activo` = 1
---
    public function getIndex($activo = 1 )
    {
        $usuarios = $this->usuarios->where('activo',$activo)->findAll();

SELECT *
FROM `cajas`
WHERE `activo` = 1
SELECT *
FROM `roles`
WHERE `activo` = 1
---
    public function getNuevo(){
      $cajas = $this->cajas->where('activo', 1)->findAll();
      $roles = $this->roles->where('activo', 1)->findAll();